data = [
    ('21-01-24', 'Ноутбук HP', 65000, 0.5 ,'Москва', 'Иванов А.'),
    ('12-01-24', 'Смартфон Samsung', 42500, 0.2 ,'Санкт-Петербург', 'Петрова Е.'),
    ('21-03-24', 'Наушники GBL', 40000, 0.2 ,'Казань', 'Федорв А.'),
    ('19-04-24', 'Принтер Canon', 35000, 0.25 ,'Краснодар', 'Киселев И.'),
    ('01-06-24', 'Монитор LG', 30000, 0.3 ,'Москва', 'Молодовский В.'),
    ('11-06-24', 'Планшет Apple', 65000, 0.2 ,'Екатеринбург', 'Сапожников Э.'),
    ('07-07-24', 'Клавиатура', 5000, 0.1 ,'Санкт-Петербуг', 'Шелепов Г.'),
    ('15-09-24', 'Игровая консоль PS5', 75000, 0 ,'Ростов-на-Дону', 'Кучеренко А.'),
    ('08-10-24', 'Смартфон Xiaomi', 41000, 0.5 ,'Волгоград', 'Сидоров К.'),
    ('09-11-24', 'Корпус', 8900, 0.2 ,'Краснодар', 'Алехина Н.')
]